Feat: higher detalisation prd (#2)
* fix: crit issues in existing PRD cleared
* feat: new PRD about data validation (Pydantic v2)
* feat: new PRD about python tooling
* feat: new PRD about authentication
* feat: mermaid diagrams instead of ascii plots
* fix: docs deploy issue
* feat: yaml frontmatter added
* feat: detected inconsistencies fix
* feat: automatic numeration
* feat: added docs standards, replaces para names with in-text links
* feat: PRD-010 about eval framework
* feat: all H(igh) issues that were detected - fixed
* feat: medium issues
- idempotency
- paused exec's
and many more
